[
    {
        "title": "Shelter Afrique Delegation meet Nigeria’s Housing Minister ahead of AGM",
        "shortDescription": "Shelter Afrique delegation meets Nigeria’s Housing Minister ahead of AGM",
        "description": [
            {
                "title": "Meeting Overview",
                "content": "Company’s 42nd Annual General Meeting will be held in Abuja during the week of 8th to 11th May 2023. Abuja, Nigeria – 15 February, 2023: Shelter Afrique delegation led by the Board Chairman Dr. Chii Akporji and Managing Director & CEO Mr. Thierno-Habib Hann held a five-day working tour of the Nigerian market where the team held talks with several stakeholders, among them, the Hon. Minister for Works and Housing, Babatunde Raji Fashola."
            },
            {
                "title": "AGM Preparations",
                "content": "The team appraised Hon. Fashola on the preparations for the Company’s 42nd AGM, which will be held in Abuja, Nigeria during the week of 8th to 11th May 2023."
            },
            {
                "title": "Statements from Dr. Akporji",
                "content": "“Shelter Afrique is grateful to the Government of the Federal Republic of Nigeria through your Ministry for supporting the delivery of its mission of providing decent and affordable housing for all in Africa. We deeply appreciate the role Nigeria has played in safeguarding the organisation and the role you have played personally in being a vanguard and a voice of reason for the shareholders,” Dr Akporji said."
            },
            {
                "title": "Statements from Dr. Chii Akporji",
                "content": "“I’m glad to inform you that preparations for the 42nd AGM are on course as the invitations have already been sent out through your office and Shelter Afrique team is working on garnering the required quorum for a successful meeting,” Dr. Chii Akporji quipped."
            },
            {
                "title": "Hon. Fashola’s Request",
                "content": "Receiving the delegation, Hon. Fashola implored the board and management of Shelter Afrique to take a leading role in financing the provision of affordable housing in Africa based on impact. He also appealed to the board to strengthen and safeguard the organisation’s corporate governance credentials as it moved into a new phase."
            },
            {
                "title": "Nigeria’s Role",
                "content": "He mentioned that as a major stakeholder, Nigeria will continue to hold Shelter Afrique to the highest standard of governance as this is critical in unlocking further investments into the organisation."
            },
            {
                "title": "Importance of Nigeria",
                "content": "Mr. Hann said a strong mission to Nigeria shows the importance Shelter Afrique places in the Nigerian market, adding the country has a critical part to play in addressing affordable housing crisis in Africa."
            },
            {
                "title": "Key Market Insights",
                "content": "“Nigeria is one of the key markets for us. Besides being the second largest shareholder after Kenya, Nigeria has one of the biggest housing needs in Africa and we are certain that if we get it right with Nigeria, we shall have gotten it right with the entire continent,” Mr. Hann said."
            },
            {
                "title": "Stakeholder Meetings",
                "content": "The team also paid courtesy calls and held talks with several other stakeholders including representatives from the Ministry of Finance, Budget and National Planning, Hon Zainab Ahmed, who reaffirmed Nigeria's firm commitment to Shelter-Afrique as one of the largest shareholders."
            },
            {
                "title": "Other Key Stakeholders",
                "content": "Other key stakeholders the team met include management and representatives from the Nigeria Mortgage Refinance Company, Mixta Africa, Landmark Africa, Infracredit, Keystone Bank, Access Bank, Lekki Gardens, the African Development Bank, Wema Bank, The Real Estate Developers of Nigeria (REDAN), Family Home Funds, Modern Shelter, Nigerian Sovereign Investment Fund (NSIA), Chapel Hill Denham, UPDC, one of the largest Real Estate developers in Nigeria, Africa Finance Corporation, as well as the Deputy Governor of the Central Bank of Nigeria; Mrs. Aisha Ahmad."
            },
            {
                "title": "Conclusion",
                "content": "“We have had great and successful working sessions with our partners and stakeholders in Nigeria and I believe this sets pace for the next phase of our engagements,” Mr. Hann concluded."
            },
            {
                "title": "Notes to Editor",
                "content": "Shelter-Afrique is the sole pan-African housing finance and development finance institution established by African governments to address the need for a sustainable housing delivery system and related infrastructure projects in Africa. Shareholders include 44 African countries, the African Development Bank, and the African Re-Insurance Corporation."
            }
        ],
        "image": "https://www.content.shelterafrique.org/en/wp-content/uploads/2023/02/SHAF-PICTURE.png",
        "date": "2023-02-15T00:00:00Z",
        "author": "Shelter Afrique Communications Team",
        "category": "Meetings",
        "tags": [
            "AGM",
            "Nigeria",
            "Housing",
            "Stakeholders"
        ],
        "additionalLinks": [
            {
                "title": "Shelter Afrique Website",
                "url": "http://www.shelterafrique.org/"
            },
            {
                "title": "Contact Babatunde Oyateru",
                "url": "mailto:boyateru@shelterafrique.org"
            }
        ]
    },
    {
        "title": "Thierno-Habib Hann assumes office as the CEO of Pan-African Housing Institution, Shelter Afrique",
        "shortDescription": "Thierno-Habib Hann assumes office as the CEO of Pan-African Housing Institution, Shelter Afrique",
        "description": [
            {
                "title": "Introduction",
                "content": "Mr. Thierno-Habib Hann brings to the Company over 20 years of international experience in housing finance, capital markets/investment banking and structured finance. Mr. Hann has a diverse experience across the private sector, public sector and DFIs."
            },
            {
                "title": "Appointment Details",
                "content": "Nairobi, Kenya: 11 January 2023 – Mr. Thierno-Habib Hann has assumed the position of the new Managing Director and Chief Executive Officer of the Nairobi-based Pan-African housing development financier Shelter Afrique following his appointment in August last year."
            },
            {
                "title": "Previous Role",
                "content": "Mr. Hann joins Shelter Afrique from the International Finance Corporation (IFC), where he served as the Asia/Pacific Lead for housing finance, based in Bangkok, Thailand."
            },
            {
                "title": "Predecessor",
                "content": "He takes over from Mr. Kingsley Muwowo, who has been serving in an acting capacity following the change in management last year."
            },
            {
                "title": "Experience and Goals",
                "content": "Mr. Hann has extensive international experience in housing finance, capital markets/investment banking and structured finance spanning over 20 years. He brings a wealth of leadership experience in development and investment, sharp insight into the real estate landscape and a strong track record of delivery."
            },
            {
                "title": "Statements from Mr. Hann",
                "content": "He is expected to strengthen governance, be an embodiment of the organisation’s values and drive the investment strategy of the Company focused on delivering large-scale affordable housing. Speaking on his appointment, Mr. Hann expressed his gratitude and appreciation, “I’m happy and honoured to take on the new role at Shelter Afrique; I would like to extend my appreciation to the Shareholders and the Board of Directors for their confidence in me. I would like to thank the staff, partners and stakeholders for their warm welcome and their commitment to the mandate of Shelter Afrique. I am also grateful to my former colleagues at the IFC and World Bank. The institution and title may have changed, but I believe we all share a joint commitment and goal of developing our world and I look forward to collaborating with them. I would especially like to thank Mr. Kingsley Muwowo for the role he has played in the transition and for his personal and professional support; his service to the Company as CFO and eventually as Acting CEO has been invaluable to the Company."
            },
            {
                "title": "Significance of Shelter Afrique",
                "content": "Mr. Hann continued on the significance of Shelter Afrique and affordable housing on the continent, “Housing is critical to the development of any nation, and Shelter-Afrique’s mandate is both unique and important, particularly as many African countries face a significant turning point in their housing agenda. We want to be part of this turning point. It is an honour to lead this team, and together, we will work towards harnessing national resources to improve local populations’ living conditions and to achieve Shelter Afrique’s mandate.”"
            },
            {
                "title": "Career Background",
                "content": "Mr. Hann began his career at the consulting firm Arthur Andersen, LLC as a Senior Consultant in Financial Services and Capital Markets in New York City. He has worked at JPMorgan Chase and Goldman Sachs as Manager and Vice President, respectively, and led investment teams issuing mortgage-backed securities (RMBS/CMO) and credit derivatives (CDS) in these organisations. He also served at the World Bank Group as the Private Sector Development Program Manager in Guinea, responsible for designing and implementing the business climate improvement program while developing a bankable pipeline of investments and government advisory projects in strategic sectors of the economy."
            },
            {
                "title": "Educational Background",
                "content": "Hann holds an MBA in Finance & Investments from the Zicklin School of Business, Bernard Baruch, City University of New York; a master’s degree in Accounting and Finance (M.S.T.C.F) and a bachelor’s degree in Management and Applied Economics (GEA), from Paris IX Dauphine University, with honours."
            },
            {
                "title": "Personal Details",
                "content": "A native of Guinea (Conakry), Habib is the co-founder of 'AngelAfrica' – a Pan-African think tank formed to achieve economic prosperity on the continent by building and fostering innovative technological ideas, investors and business partnerships."
            },
            {
                "title": "Future Plans",
                "content": "Speaking on his plans for Shelter Afrique, the new Managing Director emphasised his focus on growing the portfolio with quality assets, generating impact for stakeholders, and ensuring shoring up the organisation’s capital base. “My immediate focus will be to optimise the organisation's performance and ensure we deliver on our mandate. To do this, in the immediate term, management is committed to strengthening the brand and corporate governance, ensuring financial sustainability with a strong execution capability, strengthening risk management framework as well as deepening capacity within the organisation and advocating for innovative solutions in the delivery of affordable housing."
            },
            {
                "title": "Stakeholder Engagement",
                "content": "“I also plan to embark on broad stakeholder engagement to understand other ways to address our mandate; we welcome the views of our shareholders and partners as the task of delivering affordable housing is a shared one, and no single organisation can address the growing housing crisis alone.”"
            },
            {
                "title": "Organisational Renewal",
                "content": "Hann also commented on the current organisation renewal and corporate governance, “We are very pleased that as part of our renewal, our Board has nominated two women to lead as Chairperson and Vice-Chairperson for the first time in our history. We look forward to their stewardship and vision for the organisation.”"
            },
            {
                "title": "Notes to Editor",
                "content": "Shelter-Afrique is a pan-African housing finance and development institution established by African governments and African Development Bank (AfDB) to address the need for a sustainable housing delivery system and related infrastructure projects in Africa. Shareholders include 44 African countries, the African Development Bank, the African Re-Insurance Corporation, and Fonds de Solidarité Africain (FSA). The company’s mandate is to provide financing through debt, quasi-equity, and equity to public and private institutions for housing and urban infrastructure projects in its member countries. Shelter Afrique builds strategic partnerships and offers a host of products and related services to support the efficient delivery of affordable housing and related urban/social infrastructure. These include project finance, financial institutions lending, equity investments & joint ventures, trade finance, and social housing. We also offer advisory services and technical assistance to a wide range of industry stakeholders."
            }
        ],
        "image": "https://www.content.shelterafrique.org/en/wp-content/uploads/2023/01/shelter-afrique-...png",
        "date": "2023-01-11T00:00:00Z",
        "author": "Shelter Afrique Communications Team",
        "category": "Appointments",
        "tags": [
            "CEO",
            "Shelter Afrique",
            "Housing",
            "Leadership"
        ],
        "additionalLinks": [
            {
                "title": "Shelter Afrique Website",
                "url": "http://www.shelterafrique.org/"
            },
            {
                "title": "Contact Babatunde Oyateru",
                "url": "mailto:boyateru@shelterafrique.org"
            }
        ]
    },
    {
        "title": "Shelter Afrique grants a line of credit of US$ 13 million to the Bank “Banque Populaire de Mauritanie”, BPM",
        "shortDescription": "Shelter Afrique grants a line of credit of US$ 13 million to the Bank “Banque Populaire de Mauritanie”, BPM",
        "description": [
            {
                "title": "Overview",
                "content": "The facility will be used to provide housing loans to BPM clients."
            },
            {
                "title": "Loan Details",
                "content": "Nairobi: 8 November 2022: The Board of Directors of Shelter-Afrique, the pan-African housing development finance company, has approved a US$13 million line of credit to the second largest bank in Mauritania, Banque Populaire De Mauritanie (BPM). The 10-year loan with a 24-month moratorium will be used to provide mortgage loans to civil servants and staff of well-established private and parastatal companies. The facility may also be used to provide loans to BPM's corporate clients for the acquisition and marketing of construction materials."
            },
            {
                "title": "Comments from Shelter Afrique",
                "content": "Commenting on the agreement, the Ag. Managing Director of Shelter Afrique; Mr. Kingsley Muwowo, said the line of credit will enable the Bank to expand its operations around affordable housing and contribute to solving the problem of housing shortage in Mauritania. 'Many African countries are facing a housing shortage and Mauritania is no exception. The approval of the $13 million facility to the Banque Populaire de Mauritanie reaffirms our commitment to addressing Mauritania's housing shortage by providing affordable housing solutions for its citizens,' said Mr Kingsley."
            },
            {
                "title": "Previous Loans",
                "content": "This is the third line of credit that Shelter Afrique has granted to the Banque Populaire de Mauritanie, the two previous loans having been fully repaid."
            },
            {
                "title": "Response from BPM",
                "content": "For his part, the General Manager of the Banque Populaire de Mauritanie, Mr. Limam Ebnou, welcomed the long-standing partnership between the two institutions. 'Our partnership with Shelter-Afriques dates back to 2011, when Société Mauritania Leasing, which became Banque Populaire de Mauritanie in 2012, benefited from its first facility. We are pleased to partner again with Shelter Afrique for a project of such magnitude, because of the many families that will be impacted. We look forward to a successful relationship and to continuing to explore other areas of interest together,' said Mr Ebnou."
            },
            {
                "title": "Impact",
                "content": "This facility is expected to have a direct impact on hundreds of families, as the bank aims to roll out the financing across its branch network."
            }
        ],
        "image": "https://www.content.shelterafrique.org/en/wp-content/uploads/2021/03/Shelter-Afrique-and-the-African-Solidarity-Fund-FSA-have-joined-forces-to-contribute-to-Africas-economic-development.jpg",
        "date": "2022-11-08T00:00:00Z",
        "author": "Shelter Afrique Communications Team",
        "category": "Financing",
        "tags": [
            "Line of Credit",
            "Shelter Afrique",
            "Banque Populaire de Mauritanie",
            "Affordable Housing"
        ],
        "additionalLinks": [
            {
                "title": "Shelter Afrique Website",
                "url": "http://www.shelterafrique.org/"
            },
            {
                "title": "Contact Kingsley Muwowo",
                "url": "mailto:kmuwowo@shelterafrique.org"
            }
        ]
    },
    {
        "title": "Shelter Afrique approves USD24 million housing loan to Lagos-based real estate firm, Landmark Africa",
        "shortDescription": "Shelter Afrique approves USD24 million housing loan to Lagos-based real estate firm, Landmark Africa",
        "description": [
            {
                "title": "Overview",
                "content": "The facility will partly finance the construction of mixed-used housing project, Landmark Waterview Apartments and refinance its existing debt."
            },
            {
                "title": "Loan Details",
                "content": "Nairobi: November 1, 2022: Pan-African housing development financier Shelter Afrique has approved a USD24.03 million (₦10 billion) commercial loan to Lagos-based Tier 1 real estate and property development firm, Landmark Africa. The 7-year line of credit with a moratorium of 36 months has been structured to partly finance the construction of mixed-use housing project, Landmark Waterview Apartments and refinance its existing debt."
            },
            {
                "title": "Comments from Shelter Afrique",
                "content": "We are excited to record this significant milestone as the first project we are partnering with Landmark Africa. This is truly a high-point for Shelter Afrique and we are happy that the deal is adding to the long and successful history the Company has had with Nigeria,” Shelter Afrique Ag. Managing Director Kingsley Muwowo said. “We remain committed to financing real estate projects that promote innovation and affordability, and we look forward to a long-term relationship with Landmark Africa,” he added."
            },
            {
                "title": "Comments from Landmark Africa",
                "content": "Commenting on the deal, Landmark Africa Chief Executive Officer, Mr. Paul Onwuanibe said, “the Landmark Africa vision is to create one stop destinations which embody the business, leisure and lifestyle philosophy.” “Such innovative undertakings in the real estate sector require a formidable financial partnership and we are pleased to have found such a partner in Shelter Afrique. We are equally pleased to receive this long-term funding, which will help accelerate the delivery of the Landmark Waterview Apartments project thus enhancing the residential play within our mixed-use ecosystem while having a multiplier effect on the existing business, leisure and lifestyle service offerings. It will also help align our capital structure to our long-term strategic goals” Mr. Onwuanibe added."
            },
            {
                "title": "Key Market",
                "content": "Nigeria remains one of the key markets for Shelter Afrique. In addition to the Landmark Africa deal, the Company has so far extended lines of credit to another Lagos-based real estate firm Mixta Africa (USD19.5 million) and Wema Bank (USD10 million), this year alone."
            }
        ],
        "image": "https://www.content.shelterafrique.org/en/wp-content/uploads/2022/10/Shelter-Afrique-approves-USD24-million-housing-loan-to-Lagos-based-real-estate-firm-Landmark-Africa.jpg",
        "date": "2022-11-01T00:00:00Z",
        "author": "Shelter Afrique Communications Team",
        "category": "Financing",
        "tags": [
            "Housing Loan",
            "Landmark Africa",
            "Shelter Afrique",
            "Real Estate",
            "Nigeria"
        ],
        "additionalLinks": [
            {
                "title": "Shelter Afrique Website",
                "url": "http://www.shelterafrique.org/"
            },
            {
                "title": "Contact Kingsley Muwowo",
                "url": "mailto:kmuwowo@shelterafrique.org"
            }
        ]
    },
    {
        "title": "Shelter Afrique Eyes Sovereign Lending Products",
        "shortDescription": "Shelter Afrique is developing a Sovereign Lending product to enhance its traditional offerings and address the impact of COVID-19 on housing goals.",
        "description": [
            {
                "title": "Overview",
                "content": "Nairobi: October 24, 2022 - Shelter Afrique is developing a Sovereign Lending product to supplement its traditional products that attend to both the demand and supply sides of the housing value chain, the pan-African housing development financier has disclosed."
            },
            {
                "title": "Background",
                "content": "Speaking in Nairobi, Shelter Afrique Ag. Managing Director Kingsley Muwowo said Africa’s GDP contraction resulting from COVID-19 pandemic was an alarming sign of slump in the inclusive housing goals in many countries and thus the need by the Company to respond to the risk of a possible governments' disengagement, while revitalizing its financial agility."
            },
            {
                "title": "Economic Impact and Strategy",
                "content": "The COVID pandemic has brought in an era of economic distress throughout Africa with an average of -3.6 per cent recession in 2020, the first recession in SSA in 25 years. In response, Shelter Afrique recently reviewed its corporate strategic plan with the aim of aligning itself to its members’ priorities and position the company for better performance and enhanced development impact. One of the results of this strategy review is the decision to develop a Sovereign Lending product to serve our member states,” Mr. Muwowo said."
            },
            {
                "title": "Current Offerings",
                "content": "Currently, the Company offers various products and related services including project finance, institutional lending, equity investments & joint ventures, trade finance, and social housing, to support the delivery of affordable housing and commercial real estate."
            },
            {
                "title": "Capacity Building",
                "content": "Mr. Muwowo was speaking at a three-day in-house capacity building on sovereign lending organized by the Company and facilitated by the African Development Bank through its training arm, the African Development Institute. Through training, Shelter Afrique aims to expand its capacities for funds absorption from the anticipated new business development, carry out product design and development, as well as support the organization’s various departments to ensure the product is developed and executed effectively."
            },
            {
                "title": "Partnership with African Development Institute",
                "content": "African Development Institute Divisional Manager, Mr. Chidozie Emenuga said the partnership with Shelter Afrique was part of the Africa Development Bank Group commitment to step up its efforts to help overcome the capacity constraint in Africa. “Capacity development is key to realizing major development goals including the SDGs- which encompasses housing for all, the Addis Ababa Accord on Accelerating Development Financing, the African Union’s Agenda 2063, and national development goals of African countries,” Mr. Emenuga said."
            }
        ],
        "image": "https://www.content.shelterafrique.org/en/wp-content/uploads/2021/09/Shelter-Afrique-fully-repays-commercial-debts-eyes-regional-bonds.jpg",
        "date": "2022-10-24T00:00:00Z",
        "author": "Shelter Afrique Communications Team",
        "category": "Financial Development",
        "tags": [
            "Sovereign Lending",
            "Capacity Building",
            "Shelter Afrique",
            "African Development Bank",
            "COVID-19 Impact"
        ],
        "additionalLinks": [
            {
                "title": "Shelter Afrique Website",
                "url": "http://www.shelterafrique.org/"
            },
            {
                "title": "Contact Kingsley Muwowo",
                "url": "mailto:kmuwowo@shelterafrique.org"
            }
        ]
    },
    {
        "title": "AAMFI will reshape Africa’s economic path, Shelter Afrique says",
        "shortDescription": "Shelter Afrique Development Bank hails the formation of AAMFI as a pivotal step for addressing Africa’s economic challenges and reshaping its economic path.",
        "description": [
            {
                "title": "Overview",
                "content": "ADDIS ABABA, 22 February 2024: Shelter Afrique Development Bank (ShafDB), a leading Pan-African institution committed to financing and advancing housing, urban, and related infrastructure development, has termed the formation of the Alliance of African Multilateral Financial Institutions (AAMFI) a ‘bold step in the right direction’. This move positions Africa to address its economic challenges and reshape its economic path."
            },
            {
                "title": "Comments from Shelter Afrique",
                "content": "At the Africa Union 37th Assembly of the African Heads of State and Government and Heads of African Multilateral financial institutions, in Addis Ababa, Ethiopia, Shelter Afrique Development Bank Managing Director & Chief Executive Officer Mr. Thierno Habib Hann highlighted Africa’s unique developmental challenges and the need for home-grown solutions. 'Shelter Afrique Development Bank is thrilled to be a founding member of AAMFI, a pivotal step in becoming a strategic negotiating force within Africa's evolving financial landscape,' said Mr. Hann."
            },
            {
                "title": "AAMFI Formation",
                "content": "AAFMI, co-founded by Shelter Afrique Development Bank along with the African Export Import Bank, Trade and Development Bank, Africa Finance Corporation, African Reinsurance Corporation, African Trade and Investment Development Insurance, and ZEP-RE PTA Reinsurance Co, is expected to become a powerful negotiating body that will enhance Africa’s position in the global financial system. Membership is open to all institutions established under treaty agreements by African states."
            },
            {
                "title": "Mandates and Objectives",
                "content": "The Alliance, also known as the Africa Club, is an alliance of treaty-based African-owned and controlled Multilateral Financial Institutions. Its mandates include addressing Africa’s development finance needs, promoting the interests of member states, advocating for Africa on global finance issues, developing innovative finance tools, supporting sustainable finance strategies, and coordinating debt management negotiations."
            },
            {
                "title": "Support from African Union",
                "content": "In his address, the African Union Champion for African Union Financial Institutions, His Excellency Nana Akufo-Addo, President of Ghana, underscored the significance of the Africa Club in driving Africa's economic transformation. 'The establishment of the Africa Club signifies our collective commitment to surmount financial challenges and propel Africa towards sustainable development,' said President Akufo-Addo."
            },
            {
                "title": "Future Institutions",
                "content": "President Akufo-Addo also noted that the African Union is fast-tracking the establishment of African Union Financial Institutions (AUFI), including the African Central Bank, the African Monetary Fund, the African Investment Bank, and the Pan-African Stock Exchange. These institutions are expected to support the continent’s socio-economic transformation and position Africa as a self-sustained financial entity."
            }
        ],
        "image": "https://www.content.shelterafrique.org/en/wp-content/uploads/2024/03/AFDB.png",
        "date": "2024-02-22T00:00:00Z",
        "author": "Shelter Afrique Communications Team",
        "category": "Financial Development",
        "tags": [
            "AAMFI",
            "Shelter Afrique",
            "Economic Development",
            "African Union",
            "Financial Institutions"
        ],
        "additionalLinks": [
            {
                "title": "Shelter Afrique Website",
                "url": "http://www.shelterafrique.org/"
            },
            {
                "title": "Contact Communications Team",
                "url": "mailto:info@shelterafrique.org"
            }
        ]
    },
    {
        "title": "Shelter Afrique extends USD 18.5 million Corporate Loan to MSD for Housing Projects in DRC",
        "shortDescription": "Shelter Afrique approves an USD 18.5 million loan to Maison Super Development (MSD) for housing projects in Lubumbashi and Kolwezi, DRC.",
        "description": [
            {
                "title": "Loan Details",
                "content": "Nairobi: September 19, 2022 - Shelter Afrique Board has approved an USD 18.5 million commercial loan to Maison Super Development (MSD), a real estate development company based in Katanga, DRC. The 5-year facility, guaranteed by A-ONE BUILDERS, will finance three ongoing projects in Lubumbashi and Kolwezi."
            },
            {
                "title": "Projects Funded",
                "content": "The loan will support the construction of the Jumbo Office Building in Kolwezi, the Alilac Office Building project in Lubumbashi, and the Munua Housing project in Lubumbashi, with expected completion dates in 2022, 2023, and 2024 respectively. These projects aim to boost commercial and residential real estate in the region."
            },
            {
                "title": "Shelter Afrique's Commitment",
                "content": "Shelter Afrique Ag. Managing Director Kingsley Muwowo emphasized the facility's role in urban regeneration. He highlighted the transformation of Lubumbashi and Kolwezi into major cities in DRC and Shelter Afrique's commitment to supporting affordable housing and commercial spaces."
            },
            {
                "title": "MSD's Perspective",
                "content": "MSD Managing Director Mr. Dharmendra Kumar expressed gratitude for the partnership with Shelter Afrique, noting that this is the third line of credit provided since 2016. The partnership has significantly contributed to transforming Lubumbashi and Kolwezi."
            },
            {
                "title": "Recent Projects in DRC",
                "content": "Shelter Afrique has been actively pursuing large-scale, low-cost housing projects in DRC, including a recent USD 11.4 million line of credit for 285 mortgages. Other projects include office buildings and residential developments in Kinshasa and other DRC cities."
            }
        ],
        "image": "https://www.content.shelterafrique.org/en/wp-content/uploads/2024/03/AFDB.png",
        "date": "2022-09-19T00:00:00Z",
        "author": "Shelter Afrique Communications Team",
        "category": "Housing Development",
        "tags": [
            "Shelter Afrique",
            "Housing Loan",
            "DRC",
            "Real Estate",
            "MSD"
        ],
        "additionalLinks": [
            {
                "title": "Shelter Afrique Website",
                "url": "http://www.shelterafrique.org/"
            },
            {
                "title": "Maison Super Development",
                "url": "https://www.maisons-super.com"
            }
        ]
    },
    {
        "title": "Shelter Afrique approves additional USD13 Million credit line to Mixta Africa",
        "shortDescription": "Shelter Afrique approves a USD13 million credit line to Mixta Real Estate PLC for real estate projects in Côte d'Ivoire, Senegal, and Morocco.",
        "description": [
            {
                "title": "Credit Line Details",
                "content": "Nairobi: November 14, 2022 - Shelter Afrique has approved a USD13 million line of credit to Lagos-based real estate firm Mixta Real Estate PLC. The 5-year facility with a 24-month moratorium will fund the Group’s real estate projects in Côte d'Ivoire, Senegal, and Morocco."
            },
            {
                "title": "Project Financing",
                "content": "The USD13 million loan will co-finance the construction of 356 housing units in Côte d'Ivoire, 162 units in Senegal, and 371 units in Morocco. The selling prices of the units vary: USD26,000 in Morocco, USD45,000 in Côte d'Ivoire, and between USD36,000 and USD52,000 in Senegal."
            },
            {
                "title": "Shelter Afrique’s Commitment",
                "content": "Shelter Afrique Ag. Managing Director Kingsley Muwowo praised the strong and long-term relationship with Mixta Africa, highlighting the common goal of developing affordable housing across Africa. The credit facilities include both Naira and Dollar denominated loans to support various projects and mitigate forex risks."
            },
            {
                "title": "Mixta Africa’s Perspective",
                "content": "Mixta Africa Executive Director and CFO Mr. Benson Ajayi commended Shelter Afrique for expanding financing options and praised the strategy of raising funds through regional local currency bonds. He expressed confidence in the Dollar-denominated facility for projects in Morocco, Senegal, and Côte d'Ivoire."
            },
            {
                "title": "Disbursement Update",
                "content": "Mr. Muwowo revealed that over USD50 million of the USD110 million raised from the Naira denominated bond had been disbursed to finance projects in Nigeria. Recent approvals include USD19.5 million for Mixta Africa in Nigeria and USD24.03 million for Landmark Africa."
            }
        ],
        "image": "https://www.content.shelterafrique.org/en/wp-content/uploads/2021/06/Shelter-Afrique-extends-US9m-housing-loan-to-Wema-Bank-Plc-as-it-completes-plans-for-Local-Currency-Bond.jpg",
        "date": "2022-11-14T00:00:00Z",
        "author": "Shelter Afrique Communications Team",
        "category": "Housing Development",
        "tags": [
            "Shelter Afrique",
            "Credit Line",
            "Mixta Africa",
            "Real Estate",
            "Housing Projects"
        ],
        "additionalLinks": [
            {
                "title": "Shelter Afrique Website",
                "url": "http://www.shelterafrique.org/"
            },
            {
                "title": "Mixta Africa",
                "url": "https://www.mixtaafrica.com"
            }
        ]
    }
]